# DisabledDisciplineException Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisabledDisciplineException Class
Members See Also
---
The exception that is thrown when the function cannot execute because a discipline is disabled. The exception specifies which discipline(s) would let the operation succeed.
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
[SerializableAttribute]
public class DisabledDisciplineException : InvalidOperationException
```

Visual Basic
---
```text
<SerializableAttribute> _
Public Class DisabledDisciplineException _
	Inherits InvalidOperationException
```

Visual C++
---
```text
[SerializableAttribute]
public ref class DisabledDisciplineException : public InvalidOperationException
```

# Inheritance Hierarchy
System..::..Object System..::..Exception Autodesk.Revit.Exceptions..::..ApplicationException Autodesk.Revit.Exceptions..::..InvalidOperationException Autodesk.Revit.Exceptions..::..DisabledDisciplineException
# See Also
DisabledDisciplineException Members
Autodesk.Revit.Exceptions Namespace